In [23]:
import numpy as np
import pandas as pd

df = pd.read_csv("../datasets/StudentsPerformance.csv")
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [24]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [25]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [83]:
# Utilizando numpy

students_note = df[["math score", "reading score", "writing score"]].to_numpy()
note_finale = np.sum(students_note, axis=1) / students_note.shape[1]

df["note finale"] = pd.Series(note_finale)
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,note finale
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333

- El rendimiento por genero:

In [84]:

female_count = df[df["gender"] == "female"]["gender"].count()
male_count = df[df["gender"] == "male"]["gender"].count()

# Hombres
df_male = df[df["gender"] == "male"][["gender", "math score", "reading score", "writing score"]]

df_male["percentage"] = df_male["math score"] + df_male["reading score"] + df_male["writing score"]/3